Revit 2026 API

# RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation) Constructor

---

**Note: This API is now obsolete.**

Constructs a new RebarBendData using the bar type, hook types, style and orientation values.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This constructor is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarBendData(RebarBarType barType, RebarStyle style, BarTerminationsData barTerminationsData);")]
public RebarBendData(
	RebarBarType barType,
	RebarHookType hookType0,
	RebarHookType hookType1,
	RebarStyle style,
	RebarHookOrientation terminationOrientation0,
	RebarHookOrientation terminationOrientation1
)
```
```vb
<ObsoleteAttribute("This constructor is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarBendData(RebarBarType barType, RebarStyle style, BarTerminationsData barTerminationsData);")>
Public Sub New (
	barType As RebarBarType,
	hookType0 As RebarHookType,
	hookType1 As RebarHookType,
	style As RebarStyle,
	terminationOrientation0 As RebarHookOrientation,
	terminationOrientation1 As RebarHookOrientation
)
```
```cpp
public:
[ObsoleteAttribute(L"This constructor is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarBendData(RebarBarType barType, RebarStyle style, BarTerminationsData barTerminationsData);")]
RebarBendData(
	RebarBarType^ barType,
	RebarHookType^ hookType0,
	RebarHookType^ hookType1,
	RebarStyle style,
	RebarHookOrientation terminationOrientation0,
	RebarHookOrientation terminationOrientation1
)
```
```fsharp
[<ObsoleteAttribute("This constructor is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarBendData(RebarBarType barType, RebarStyle style, BarTerminationsData barTerminationsData);")>]
new :
        barType : RebarBarType *
        hookType0 : RebarHookType *
        hookType1 : RebarHookType *
        style : RebarStyle *
        terminationOrientation0 : RebarHookOrientation *
        terminationOrientation1 : RebarHookOrientation -> RebarBendData
```

#### Parameters

barType RebarBarType
     The RebarBarType.
hookType0 RebarHookType
     The RebarHookType for the start. Can be .
hookType1 RebarHookType
     The RebarHookType for the end. Can be .
style RebarStyle
     The style.
terminationOrientation0 RebarHookOrientation
     The termination orientation for the start.
terminationOrientation1 RebarHookOrientation
     The termination orientation for the end.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

RebarBendData Class

RebarBendData Overload

Autodesk.Revit.DB.Structure Namespace